In [1]:
import pandas as pd

In [5]:
df1 = pd.read_csv("dataset_sample/concat_1.csv")
df2 = pd.read_csv("dataset_sample/concat_2.csv")
df3 = pd.read_csv("dataset_sample/concat_3.csv")

In [7]:
df1.head()

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [9]:
df2.head()

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [10]:
df3.head()

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [15]:
#pd.concat : 데이터프레임 3개를 합쳐서 반환함, 행방향으로 추가, 인덱스 유지
row_concat= pd.concat([df1, df2, df3])
row_concat

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [17]:
print(row_concat.loc[5,]) #오류발생, 인덱스 값이 0 1 2 3 으로 고정됨

KeyError: 5

In [18]:
print(row_concat.iloc[5,]) #iloc의 경우 가능, 꼭 기억해두자

A    a5
B    b5
C    c5
D    d5
Name: 1, dtype: object

In [19]:
row_concat1 = pd.concat([df1, df2, df2], ignore_index = True)
#ignore_index가 들어가면 달라진다, 인덱스 무시 후 순서대로 재배열
print(row_concat1)

     A   B   C   D
0   a0  b0  c0  d0
1   a1  b1  c1  d1
2   a2  b2  c2  d2
3   a3  b3  c3  d3
4   a4  b4  c4  d4
5   a5  b5  c5  d5
6   a6  b6  c6  d6
7   a7  b7  c7  d7
8   a4  b4  c4  d4
9   a5  b5  c5  d5
10  a6  b6  c6  d6
11  a7  b7  c7  d7

In [20]:
new_series = pd.Series(["n1","n2","n3","n4"])

In [21]:
pd.concat([df1, new_series]) 
#새로운 열이 생김, 시리즈에는 열 이름이 배정되어 있지 않기 때문임

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4

In [23]:
print(pd.concat([df1, new_series], axis = 1)) #열방향 데이터 붙이기

    A   B   C   D   0
0  a0  b0  c0  d0  n1
1  a1  b1  c1  d1  n2
2  a2  b2  c2  d2  n3
3  a3  b3  c3  d3  n4

In [25]:
new_row_df = pd.DataFrame([["n1","n2","n3","n4"]],
                         columns = ["A","B","C","D"])
new_row_df #행이 하나인 데이터프레임 생성

    A   B   C   D
0  n1  n2  n3  n4

In [30]:
print(pd.concat([df1, new_row_df])) #행방향 데이터 붙이기, 기본값임
#axis = 0

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

In [32]:
col_concat = pd.concat([df1,df2,df3], axis = 1)
col_concat #열방향 이어붙이기 : axis= 1

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [33]:
print(col_concat["A"]) #마찬가지로 열 인덱스 그대로 유지됨

    A   A    A
0  a0  a4   a8
1  a1  a5   a9
2  a2  a6  a10
3  a3  a7  a11

In [35]:
col_concat = pd.concat([df1,df2,df3], ignore_index = True, axis = 1)
col_concat 
#ignore_index : 모든 인덱스를 기본값인 0부터 시작하는 정수값으로 변환함

   0   1   2   3   4   5   6   7    8    9    10   11
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [36]:
col_concat["new_col"] = ["n1","n2","n3","n4"]

In [37]:
col_concat #이런식으로 간단하게 추가 가능(당연)

    0   1   2   3   4   5   6   7    8    9   10   11 new_col
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8      n1
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9      n2
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10      n3
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11      n4

In [39]:
ebola = pd.read_csv("dataset_sample/country_timeseries.csv")

In [40]:
print(ebola.shape)

(122, 18)

In [41]:
print(ebola.head())

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           NaN         8157.0                NaN
4  12/31/2014  284        2730.0         8115.0             9633.0

   Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  Cases_Mali  \
0            NaN            NaN                 NaN          NaN         NaN
1            NaN            NaN                 NaN          NaN         NaN
2            NaN            NaN                 NaN          NaN         NaN
3            NaN            NaN                 NaN          NaN         NaN
4            NaN            NaN                 NaN          NaN         NaN

   Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  Deaths_Nigeria  \
0         1786.0             NaN              2977.0             NaN
1         1781.0             NaN              2943.0             NaN
2         1767.0          3496.0              2915.0             NaN
3            NaN          3496.0                 NaN             NaN
4         1739.0          3471.0              2827.0             NaN

   Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  Deaths_Mali
0             NaN                  NaN           NaN          NaN
1             NaN                  NaN           NaN          NaN
2             NaN                  NaN           NaN          NaN
3             NaN                  NaN           NaN          NaN
4             NaN                  NaN           NaN          NaN

# 결손값 제거하기: 
### count/isnull/fillna/interpolate/dropna/skipna..

In [42]:
print(ebola.columns)

Index(['Date', 'Day', 'Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone',
       'Cases_Nigeria', 'Cases_Senegal', 'Cases_UnitedStates', 'Cases_Spain',
       'Cases_Mali', 'Deaths_Guinea', 'Deaths_Liberia', 'Deaths_SierraLeone',
       'Deaths_Nigeria', 'Deaths_Senegal', 'Deaths_UnitedStates',
       'Deaths_Spain', 'Deaths_Mali'],
      dtype='object')

In [44]:
 print(ebola.count()) #요소의 합:df.count(), 누락값은 자동으로 제외

Date                   122
Day                    122
Cases_Guinea            93
Cases_Liberia           83
Cases_SierraLeone       87
Cases_Nigeria           38
Cases_Senegal           25
Cases_UnitedStates      18
Cases_Spain             16
Cases_Mali              12
Deaths_Guinea           92
Deaths_Liberia          81
Deaths_SierraLeone      87
Deaths_Nigeria          38
Deaths_Senegal          22
Deaths_UnitedStates     18
Deaths_Spain            16
Deaths_Mali             12
dtype: int64

In [46]:
#122행 - 데이터가 존재하는 행 개수 = 각 행에 들어있는 결측값 개수
missing = ebola.shape[0]- ebola.count()
print(missing)

Date                     0
Day                      0
Cases_Guinea            29
Cases_Liberia           39
Cases_SierraLeone       35
Cases_Nigeria           84
Cases_Senegal           97
Cases_UnitedStates     104
Cases_Spain            106
Cases_Mali             110
Deaths_Guinea           30
Deaths_Liberia          41
Deaths_SierraLeone      35
Deaths_Nigeria          84
Deaths_Senegal         100
Deaths_UnitedStates    104
Deaths_Spain           106
Deaths_Mali            110
dtype: int64

In [47]:
import numpy as np

In [48]:
print(np.count_nonzero(ebola.isnull())) 
#총 결측값을 알아내는 적절한 방법중 하나: count_nonzero와 isnull 메서드의 동시 사용

1214

In [49]:
print(np.count_nonzero(ebola['Cases_Guinea'].isnull()))

29

In [50]:
print(np.count_nonzero(ebola['Cases_Nigeria'].isnull()))

84

In [51]:
#np의 결측값 메서드 : fillna 메서들를 활용한 결측값 값 대치
#참 간단하고 쉽다!
print(ebola.fillna(0))

           Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0      1/5/2015  289        2776.0            0.0            10030.0
1      1/4/2015  288        2775.0            0.0             9780.0
2      1/3/2015  287        2769.0         8166.0             9722.0
3      1/2/2015  286           0.0         8157.0                0.0
4    12/31/2014  284        2730.0         8115.0             9633.0
..          ...  ...           ...            ...                ...
117   3/27/2014    5         103.0            8.0                6.0
118   3/26/2014    4          86.0            0.0                0.0
119   3/25/2014    3          86.0            0.0                0.0
120   3/24/2014    2          86.0            0.0                0.0
121   3/22/2014    0          49.0            0.0                0.0

     Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  \
0              0.0            0.0                 0.0          0.0
1              0.0            0.0                 0.0          0.0
2              0.0            0.0                 0.0          0.0
3              0.0            0.0                 0.0          0.0
4              0.0            0.0                 0.0          0.0
..             ...            ...                 ...          ...
117            0.0            0.0                 0.0          0.0
118            0.0            0.0                 0.0          0.0
119            0.0            0.0                 0.0          0.0
120            0.0            0.0                 0.0          0.0
121            0.0            0.0                 0.0          0.0

     Cases_Mali  Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  \
0           0.0         1786.0             0.0              2977.0
1           0.0         1781.0             0.0              2943.0
2           0.0         1767.0          3496.0              2915.0
3           0.0            0.0          3496.0                 0.0
4           0.0         1739.0          3471.0              2827.0
..          ...            ...             ...                 ...
117         0.0           66.0             6.0                 5.0
118         0.0           62.0             0.0                 0.0
119         0.0           60.0             0.0                 0.0
120         0.0           59.0             0.0                 0.0
121         0.0           29.0             0.0                 0.0

     Deaths_Nigeria  Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  \
0               0.0             0.0                  0.0           0.0
1               0.0             0.0                  0.0           0.0
2               0.0             0.0                  0.0           0.0
3               0.0             0.0                  0.0           0.0
4               0.0             0.0                  0.0           0.0
..              ...             ...                  ...           ...
117             0.0             0.0                  0.0           0.0
118             0.0             0.0                  0.0           0.0
119             0.0             0.0                  0.0           0.0
120             0.0             0.0                  0.0           0.0
121             0.0             0.0                  0.0           0.0

     Deaths_Mali
0            0.0
1            0.0
2            0.0
3            0.0
4            0.0
..           ...
117          0.0
118          0.0
119          0.0
120          0.0
121          0.0

[122 rows x 18 columns]

In [53]:
df= pd.DataFrame([['아이유', 30], ['김지희', np.nan], ['손흥민', 31]], columns= ['이름', '나이'])
print(df)

    이름    나이
0  아이유  30.0
1  김지희   NaN
2  손흥민  31.0

In [54]:
#interpolate 메서드를 사용해서 결측값 양쪽 값의 중간값으로 변경하기
#2와 4사이에 있는 결측값을 대입해줌
df.interpolate() #자동으로 대치된 값이 들어간 dataframe 반환

    이름    나이
0  아이유  30.0
1  김지희  30.5
2  손흥민  31.0

In [55]:
#결측값을 포함한 행을 완전히 삭제하기 : dropna
drop = df.dropna()
print(drop)

    이름    나이
0  아이유  30.0
2  손흥민  31.0

In [56]:
print(ebola.Cases_Guinea.sum(skipna= True)) # 기니아 열의 합계 구하기

84729.0

In [57]:
print(ebola.Cases_Liberia.mean(skipna= True)) # 라이베리아 열의 평균 구하기

2335.3373493975905

In [59]:
#iloc 5행까지, 특정 열만 보자
guinea= ebola.iloc[:, [0,1,2,10]]
print(guinea)

           Date  Day  Cases_Guinea  Deaths_Guinea
0      1/5/2015  289        2776.0         1786.0
1      1/4/2015  288        2775.0         1781.0
2      1/3/2015  287        2769.0         1767.0
3      1/2/2015  286           NaN            NaN
4    12/31/2014  284        2730.0         1739.0
..          ...  ...           ...            ...
117   3/27/2014    5         103.0           66.0
118   3/26/2014    4          86.0           62.0
119   3/25/2014    3          86.0           60.0
120   3/24/2014    2          86.0           59.0
121   3/22/2014    0          49.0           29.0

[122 rows x 4 columns]

In [60]:
#date day만 고정시키고 나머지는 행으로 피벗 테이블화
#122행 > 244행
guinea_long = pd.melt(guinea, id_vars= ["Date","Day"])
guinea_long.shape

(244, 4)

In [61]:
print(guinea_long)

           Date  Day       variable   value
0      1/5/2015  289   Cases_Guinea  2776.0
1      1/4/2015  288   Cases_Guinea  2775.0
2      1/3/2015  287   Cases_Guinea  2769.0
3      1/2/2015  286   Cases_Guinea     NaN
4    12/31/2014  284   Cases_Guinea  2730.0
..          ...  ...            ...     ...
239   3/27/2014    5  Deaths_Guinea    66.0
240   3/26/2014    4  Deaths_Guinea    62.0
241   3/25/2014    3  Deaths_Guinea    60.0
242   3/24/2014    2  Deaths_Guinea    59.0
243   3/22/2014    0  Deaths_Guinea    29.0

[244 rows x 4 columns]